Veyronix/MQTT_Thermometer/stm32/Src/main.c
  /* Clear the Background Layer */
  BSP_LCD_Clear(LCD_COLOR_WHITE);
  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);

  BSP_LCD_SetColorKeying(1,LCD_COLOR_WHITE);

  /* Select the LCD Foreground Layer  */
  BSP_LCD_SelectLayer(1);

  /* Clear the Foreground Layer */
  BSP_LCD_Clear(LCD_COLOR_WHITE);
  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);

  /* Configure the transparency for foreground and background :
     Increase the transparency */
  BSP_LCD_SetTransparency(0, 255);
  BSP_LCD_SetTransparency(1, 255);
}

//[rmv]
void draw_button(int button[4], uint32_t color, uint8_t* text);
void draw_background(void)
{
	/* Select the LCD Background Layer  */
	BSP_LCD_SelectLayer(0);
	BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
	BSP_LCD_FillRect(0,0,LCD_X_SIZE,LCD_Y_SIZE);

	//select Foreground Layer
	BSP_LCD_SelectLayer(1);
	// char greeting[] = "Hello";
	// draw_button(50,50,100,100,LCD_COLOR_MAGENTA,&greeting);
}

void draw_button(int button[4], uint32_t color, uint8_t* text){
  int xPos = button[0];
  int yPos = button[1];
  int width = button[2];
  int height = button[3];

	BSP_LCD_SelectLayer(0);
	BSP_LCD_SetTextColor(color);
	BSP_LCD_DrawRect(xPos,yPos,width,height);
	BSP_LCD_SetTextColor(LCD_COLOR_DARKBLUE);
	BSP_LCD_DisplayStringAt(xPos+5, yPos+5, text, 0);

}

void draw_chart(float* data){

    int chart_height = 200;
	int chart_height_coord = 230;
    int chart_length = 450;
    int chart_y_pos = 250;
    int chart_x_pos = 20;
	int chart_y_pos_coord = 20;

//drawing coordinates system
    BSP_LCD_SelectLayer(0);
    BSP_LCD_Clear(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DrawHLine(chart_x_pos,chart_y_pos,chart_length);
    BSP_LCD_DrawVLine(chart_x_pos,chart_y_pos_coord,chart_height_coord);
    
//    BSP_LCD_FillTriangle(chart_length-10,chart_length-10,chart_length,chart_y_pos+5,chart_y_pos-5,chart_y_pos);
    int n = 90; //sizeof(data)/sizeof(data[0]);
    float max = data[0];
    float min = data[0];//0;//data[0];

    for(int i=1; i<n; i++){
      if(data[i] < min)
          min = data[i];
      if(data[i] > max)
          max = data[i];
    }
    int min_i = min;//0;//min;
    int max_i = max;
    float coordinates_scale = chart_height/(max_i - min_i);
    float amplitude = max - min; // ?
    float scale = chart_height/amplitude; // ?

// draw scale
    int y = chart_y_pos;
    BSP_LCD_SetTextColor(LCD_COLOR_LIGHTGRAY);
    for(int i=1;i<amplitude;i++){
      BSP_LCD_DrawHLine(chart_x_pos,chart_y_pos-i*coordinates_scale,chart_length);
    }

// draw data
  BSP_LCD_SetTextColor(LCD_COLOR_DARKBLUE);

  int sample_len = chart_length/n;
  for(int i=0; i<n-1; i++){
    int x1,y1,x2,y2;
    x1 = chart_x_pos + i * sample_len;
    x2 = chart_x_pos + (i+1) * sample_len;
    y1 = chart_y_pos - (data[i] - min_i)*coordinates_scale;
    y2 = chart_y_pos - (data[i+1] - min_i)*coordinates_scale;

    BSP_LCD_DrawLine(x1,y1,x2,y2);

  }
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	Point points[3];
	points[0].X=chart_x_pos+5;
	points[1].X=chart_x_pos-5;
	points[2].X=chart_x_pos;
	
	points[0].Y=chart_y_pos_coord+10;
	points[1].Y=chart_y_pos_coord+10;
	points[2].Y=chart_y_pos_coord;
	BSP_LCD_FillPolygon(points,3);

	points[0].X=chart_x_pos+chart_length-10;
	points[1].X=chart_x_pos+chart_length;
	points[2].X=chart_x_pos+chart_length-10;

	points[0].Y=chart_y_pos-5;
	points[1].Y=chart_y_pos;
	points[2].Y=chart_y_pos+5;
	BSP_LCD_FillPolygon(points,3);
	//BSP_LCD_FillPolygon(chart_x_pos-5,chart_x_pos-5,chart_x_pos+5,chart_height-10,chart_height,chart_height-10);


	BSP_LCD_SetFont(&Font12);
	
	int j = 0;
	for(int i = min; i <=max ; i+=5){
		int someInt = i;
		char str[3];
		sprintf(str, "%d", someInt);
		BSP_LCD_DisplayStringAt(chart_x_pos-15,chart_y_pos-5-j*coordinates_scale, (uint8_t*)str, LEFT_MODE);
		j+=5;
	}
	/*
	BSP_LCD_DisplayStringAt(chart_x_pos-15,chart_y_pos-5, (uint8_t*)"0", LEFT_MODE);
	BSP_LCD_DisplayStringAt(chart_x_pos-15,chart_y_pos-5-5*coordinates_scale, (uint8_t*)"5", LEFT_MODE);
	BSP_LCD_DisplayStringAt(chart_x_pos-15,chart_y_pos-5-10*coordinates_scale, (uint8_t*)"10", LEFT_MODE);
	BSP_LCD_DisplayStringAt(chart_x_pos-15,chart_y_pos-5-15*coordinates_scale, (uint8_t*)"15", LEFT_MODE);
	*/
	}

static TS_StateTypeDef  TS_State;


int initialize_touchscreen(void)
{
	uint8_t  status = 0;
	status = BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
	if(status != TS_OK) return -1;
	return 0;
}

 int print_data(char* data, int client_id, int len){
	BSP_LCD_SetFont(&LCD_DEFAULT_FONT);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	BSP_LCD_SetTextColor(LCD_COLOR_DARKBLUE);
	if(client_id == 1){
		printf("%s\n",data);
		int i;
		for(i = 10; i < 70;i++)
			BSP_LCD_ClearStringLine(i);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_FillRect(0.3*LCD_X_SIZE,0.1*LCD_Y_SIZE,10,50);
		BSP_LCD_SetTextColor(LCD_COLOR_DARKBLUE);
		BSP_LCD_ClearStringLine(10);
		BSP_LCD_ClearStringLine(50);
		char target[100];

		strncpy(target, data, len);
		target[len] = '\0';
		BSP_LCD_DisplayStringAt(0, 10, (uint8_t*)"Temperature1 is:", CENTER_MODE);
		BSP_LCD_DisplayStringAt(0, 50, (uint8_t*)target, CENTER_MODE);
	}
	else{
	printf("%s\n",data);
	char target[100];
	BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_FillRect(0.3*LCD_X_SIZE,0.1*LCD_Y_SIZE,10,50);
		BSP_LCD_SetTextColor(LCD_COLOR_DARKBLUE);
	strncpy(target, data, len);
	target[len] = '\0';
	BSP_LCD_DisplayStringAt(0, 70, (uint8_t*)"Temperature2 is:", CENTER_MODE);
	BSP_LCD_DisplayStringAt(0, 110, (uint8_t*)target, CENTER_MODE);
	}
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{


  float data[90] = {20.34,21.39,20.05,25.07,21.97,24.27,26.34,26.39,26.32,22.01,20.34,27.39,22.05,25.07,20.97,24.27,26.34,20.39,26.32,22.01,20.34,21.39,22.05,21.07,26.97,20.23,26.34,26.39,26.32,22.01,20.34,21.39,22.05,25.07,26.97,24.27,26.34,26.39,26.32,22.01,20.34,21.39,22.05,25.07,26.97,24.27,26.34,26.39,26.32,22.01,20.34,21.39,22.05,25.07,26.97,24.27,26.34,26.39,26.32,22.01,20.34,21.39,22.05,25.07,26.97,24.27,26.34,26.39,26.32,22.01,20.34,21.39,22.05,25.07,26.97,24.27,26.34,26.39,26.32,22.01,20.34,21.39,22.05,25.07,26.97,24.27,26.34,26.39,26.32,22.01};

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

