Veyronix/MQTT_Thermometer/stm32/Src/main.c
}

static void mqtt_sub_request_cb(void *arg, err_t result)
{
  /* Just print the result code here for simplicity,
     normal behaviour would be to take some action if subscribe fails like
     notifying user, retry subscribe or disconnect from server */
  printf("Subscribe result: %d\n", result);
  if(result == ERR_OK){
  printf("Subscribe result is OK!\n");
  }
}

//-----------------------------------------------------------------
//3. Implementing callbacks for incoming publish and data

/* The idea is to demultiplex topic and create some reference to be used in data callbacks
   Example here uses a global variable, better would be to use a member in arg
   If RAM and CPU budget allows it, the easiest implementation might be to just take a copy of
   the topic string and use it in mqtt_incoming_data_cb
*/
static int inpub_id;
static void mqtt_incoming_publish_cb(void *arg, const char *topic, u32_t tot_len) // callback invoked when publish starts, contain topic and total length of payload
{
  printf("Incoming publish at topic %s with total length %u\n", topic, (unsigned int)tot_len);

  /* Decode topic string into a user defined reference */
  if(strcmp(topic, "print_payload") == 0) {
    inpub_id = 0;
  } else if(topic[0] == 'A') {
    /* All topics starting with 'A' might be handled at the same way */
    inpub_id = 1;
  } else if(strcmp(topic,"esp/temperature/client1") == 0){
	inpub_id = 2;
  }
  else {
    /* For all other topics */
    inpub_id = 3;
  }
}

static void mqtt_incoming_data_cb(void *arg, const u8_t *data, u16_t len, u8_t flags) // callback for each fragment of payload that arrives
{
  printf("Incoming publish payload with length %d, flags %u\n", len, (unsigned int)flags);

  if(flags & MQTT_DATA_FLAG_LAST && which_window == 2) {
    /* Last fragment of payload received (or whole part if payload fits receive buffer
       See MQTT_VAR_HEADER_BUFFER_LEN)  */

    /* Call function or do action depending on reference, in this case inpub_id */
    if(inpub_id == 0) {
      /* Don't trust the publisher, check zero termination */
      if(data[len-1] == 0) {
        printf("mqtt_incoming_data_cb: %s\n", (const char *)data);
      }
    } else if(inpub_id == 1) {
      /* Call an 'A' function... */

	  xprintf("Call an A function ...\n");

    } else if(inpub_id == 2){
		print_data((const char *)data, 1,len);
	}
	else {
      //printf("mqtt_incoming_data_cb: Ignoring payload...\n");
	  printf("mqtt_incoming_data_cb: %s\n", (const char *)data);
	  print_data((const char *)data,2,len);
    }
  } else {
    /* Handle fragmented payload, store in buffer, write to file or whatever */
  }
  //data = NULL;
}

//-----------------------------------------------------------------
//4. Using outgoing publish
 static void mqtt_pub_request_cb(void *arg, err_t result)
{
  if(result != ERR_OK) {
    printf("Publish result: %d\n", result);
  }
}

void example_publish(mqtt_client_t *client, void *arg)
{
  const char *pub_payload= "give_temperature";
  err_t err;
  u8_t qos = 2; /* 0 1 or 2, see MQTT specification */
  u8_t retain = 0; /* No don't retain such crappy payload... */
  err = mqtt_publish(client, "esp/temperature", pub_payload, strlen(pub_payload), qos, retain, mqtt_pub_request_cb, arg);
  if(err != ERR_OK) {
    printf("Publish err: %d\n", err);
  }
}

// zmienna jest u gory bo przyjmowanie danych musi wiedziec czy moze wyswietlic je
// int which_window = 0;

int button_return[4] = {0,0,0,0};
int button_choose_thermometer1[4] = {0,0,0,0};
int button_choose_thermometer2[4] = {0,0,0,0};
int button_show_temperature[4] = {0,0,0,0};
int button_show_charts[4] = {0,0,0,0};

void draw_menu(){
  BSP_LCD_Clear(LCD_COLOR_WHITE);
  BSP_LCD_SelectLayer(0);
  BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
  // BSP_LCD_FillRect(0,0,LCD_X_SIZE,LCD_Y_SIZE);

  //select Foreground Layer
  BSP_LCD_SelectLayer(1);
  char actual[] = "Actual temperature";
  char charts[] = "Temperature charts";
  draw_button(button_show_temperature,LCD_COLOR_MAGENTA,&actual);
  draw_button(button_show_charts,LCD_COLOR_MAGENTA,&charts);

}

void draw_choose_thermometer(){
  BSP_LCD_Clear(LCD_COLOR_WHITE);
  BSP_LCD_SelectLayer(0);
  BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
  // BSP_LCD_FillRect(0,0,LCD_X_SIZE,LCD_Y_SIZE);

  //select Foreground Layer
  BSP_LCD_SelectLayer(1);
  char thermometer1[] = "Thermometer 1";
  char thermometer2[] = "Thermometer 2";
  draw_button(button_choose_thermometer1,LCD_COLOR_MAGENTA,&thermometer1);
  draw_button(button_choose_thermometer2,LCD_COLOR_MAGENTA,&thermometer2);

}

void draw_actual_temperature(){

  
}


void draw_chart(int id_thermometer){

  //narysuj odpowiedni wykres


}

int touched_button(int button[4],int x, int y){
  if(button[0] <= x && (button[0] + button[2]) >= x && button[1] <= y && (button[3] + button[1]) >= y){
    return 1;
  }
  return 0;
}


void StartDefaultTask(void const * argument)
{
  MX_LWIP_Init();

  /*MQTT */

  int tmp = 1; //1
  mqtt_client_t static_client;
  while(tmp == 1){
	xprintf("Trying to connect\n");
	vTaskDelay(1000);
	tmp = example_do_connect(&static_client);
	vTaskDelay(1000);
  //xprintf("tutaj koniecx");
  }

  for(;;)
  {

	BSP_TS_GetState(&TS_State);
	if(TS_State.touchDetected)
	{
    
    //pobrac jakos wspolrzedne dotknietego pola
    int x = 0;
    int y = 0;
    if(which_window == 0){
      if(touched_button(button_show_charts,x,y) == 1){
        draw_choose_thermometer();
        which_window = 1;
      }
      else if(touched_button(button_show_temperature,x,y) == 1){
        // draw_actual_temperature();
        //przy otrzymaniu danych mqtt pokaze temperature
        which_window = 2;
      }
    }
    else if(which_window == 1){
      if(touched_button(button_choose_thermometer1,x,y) == 1){
        draw_chart();
        which_window = 3;
      }
      else if(touched_button(button_choose_thermometer2,x,y) == 1){
        draw_chart();
        which_window = 3;
      }
    }
    else if(which_window == 2){
      if(touched_button(button_return,x,y) == 1){
        draw_menu();
        which_window = 0;
      }
    }
    else if(which_window == 3){
      if(touched_button(button_return,x,y) == 1){
        draw_menu();
        which_window = 0;
      }
    }
	}

	char key = inkey();
	if(key == 'p'){
		xprintf("Send message \n");
		example_publish(&static_client,2);
	}


	vTaskDelay(2);

